Revit 2027 API
MEPCalculationServerInfo.GetMEPCalculationServerInfo Method
 Gets a MEPCalculationServerInfo by family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MEPCalculationServerInfo GetMEPCalculationServerInfo(
	FamilyInstance famInst
)
Public Shared Function GetMEPCalculationServerInfo (
	famInst As FamilyInstance
) As MEPCalculationServerInfo
public:
static MEPCalculationServerInfo^ GetMEPCalculationServerInfo(
	FamilyInstance^ famInst
)
static member GetMEPCalculationServerInfo :
        famInst : FamilyInstance -> MEPCalculationServerInfo
Parameters
famInst FamilyInstance
 The family instance.
Return Value
MEPCalculationServerInfo
 The MEPCalculationServerInfo.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace